examples/quick-start-artillery/engine-test-id.yaml
config:
  target: my_target
  tracetest:
    token: <YOUR_TRACETES_ENV_TOKEN>
  phases:
    - duration: 2
      arrivalRate: 5
  engines:
    tracetest: {}
scenarios:
  - name: tracetest_engine_test
    engine: tracetest
    flow:
      - test:
          id: artillery-engine-import-pokemon
          runInfo:
            variables:
              - key: ENDPOINT
                value: http://api:8081
              - key: POKEMON_ID
                value: "6"
      - summary:
          format: "pretty"