examples/quick-start-artillery/plugin-test.yaml
config:
  target: "http://localhost:8081"
  phases:
    - duration: 5
      arrivalRate: 5
  plugins:
    publish-metrics:
      - type: "open-telemetry"
        serviceName: "artillery"
        metrics:
          reporter: otlp-http
          endpoint: "http://localhost:4318/v1/metrics"
          attributes:
            environment: "test"
            tool: "Artillery"
            type: "Load test"

        traces:
          reporter: otlp-http
          endpoint: "http://localhost:4318/v1/traces"
          attributes:
            environment: "test"
            tool: "Artillery"
    tracetest:
      token: <YOUR_TRACETEST_TOKEN>
      definition: import-pokemon-plugin.yaml
      runInfo:
        variables:
          - key: POKEMON_ID
            value: "6"
scenarios:
  - name: "Import Pokemon"
    flow:
      - post:
          url: "/pokemon/import"
          json:
            id: 6